hw2/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY created_at DESC
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "department", "number", "credits", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "number" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["number", "4200"], ["updated_at", "2018-10-06 19:22:56.814367"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
  def destroy
    @course.destroy

SELECT "courses".* FROM "courses" WHERE (name like '%web')
---
  def search
    @courses = Course.where("name like ?", "%#{params[:q]}%")