hw2/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

SELECT "students".* FROM "students"
---
  def new
    @section = Section.new
    @students = Student.all

SELECT "students".* FROM "students"
---
  def edit
    @students = Student.all

INSERT INTO "sections" ("semester", "number", "course_id", "room", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["semester", "Fall 18"], ["number", "20493"], ["course_id", 1], ["room", "Central 109"], ["created_at", "2018-09-22 18:50:48.716934"], ["updated_at", "2018-09-22 18:50:48.716934"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

UPDATE "sections" SET "room" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["room", "Science 300"], ["updated_at", "2018-10-03 14:41:10.548502"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @section.update(section_params)

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
---
  def destroy
    @section.destroy

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])