hw2/app/controllers/students_controller.rb

  def new
    @student = Student.new
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def edit
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2018-10-02 23:08:47.563397"], ["updated_at", "2018-10-02 23:08:47.563397"]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]