hw2/app/views/sections/_form.html.erb

SELECT "courses".* FROM "courses"
---
    <%= f.label :course_id %>
    <%= f.collection_select :course_id, Course.all, :id, :name %>