hw2/app/views/sections/show.html.erb

<ul>
  <%@section.students.each do |student|%>
---
SELECT "students".* FROM "students" INNER JOIN "sections_students" ON "students"."id" = "sections_students"."student_id" WHERE "sections_students"."section_id" = ?  [["section_id", 3]]